{
  "title": "Biblical Timeline",
  "bibleVersions": "en CSB-1713 NIV-111 NET-107 ESV-59 HCSB-72",
  "tip": "<strong>TIP:</strong> Hold down the <0>Shift</0> key for horizontal scrolling",
  "notes": {
    "title": "Important Notes",
    "button": "NOTES",
    "howMade": {
      "title": "Where Did All These Dates Come From?",
      "description_wTags": [
        "Plotting Biblical dates can be tedious and difficult. First of all, there are just <i>so many</i> dates to keep track of, but moreso, everything is in relation to everything else. For example, to get the year Joseph was born: we see that it was 30 years prior to the 14-year period of feast and famine in Egypt ... which began 9 years prior to Jacob's arrival there ... which happened 17 years before his death ... which was 147 years after his birth ... which happened 60 years after Isaac's birth ... which was 100 years after Abraham's birth ... and on and on back to Adam which ultimately establishes <i>all</i> the dates on the calendar. Whew!",

        "After trying to \"check the math\", so to speak, on one author's claims, I realized that a computer could do this stuff much easier than me, and being a web developer, I decided it would be a fun little project to take on. Very quickly I realized that there are a lot of opinions and assumptions out there regarding Biblical dates, and nothing is <i>quite</i> as clean and clear-cut as you might think. So I decided to just add that variability as options with the benefit of getting to see what the different assumptions do to the timeline in relation to everything else.",

        "As stated above, every date on the calendar is ultimately calculated relationally from Adam all the way to the Crucifixion using just the Bible. Once all the Biblical dates are calculated, I then use the user setting for the Gregorian date of the Crucifixion to then calculate and add all of the Gregorian dates to all of the events. Also once this is done, I am able to add secular, Gregorian-only dates to the timeline as well.",

        "<0><0></0> <strong>AM / CE</strong></0> — Using the toggle at the top of the page, you can switch between displaying the Hebrew dates: AM (<i>anno mundi</i>), or the Gregorian dates: CE (common era - BC/AD) ",

        "<0><0></0> <strong>$t(options.display.showSource.title)</strong> — On / Off</0> — Turn this on to show pop-up tooltips for each event listing the Bible verses referenced as well as a plain-language explanation of how the engine placed the item onto the timeline. If you don't need it, these pop-ups can be pretty annoying, so I have it disabled by default."
      ]
    },
    "inclusiveTime": {
      "title": "Time and the Bible: Inclusive vs. Exclusive",
      "description_wTags": [
        "It is important to understand that the Bible uses an <strong><i>inclusive</i></strong> reconing of time which can be foreign to our modern, Western, <i>exclusive</i> thinking.",

        "To illustrate, imagine the birth of a baby; only a full year later would we say that that baby is one year old, i.e., they have been alive for (at least) one full year. However, in Ancient Isreal, <i>as soon as they were born</i> it would have been said that the baby was one, i.e., they were in their first year.",

        "Applying this to a Biblical example, in Gen 5:32 when we read, \"<i>Noah was 500 years old, and he fathered Shem, Ham, and Japheth,</i>\" we must understand that it is meaning that he was \"in his 500th year\" even though we would recon him to be 499 years old by our exclusive thinking.",

        "All of this is to say that if you aren't expecting the difference between inclusive and exlusive reconing of time, the timeline might seem weird or off to you.",

        "On a related note, because this timeline was built primarily to plot out the history recorded in the Bible, using inclusive dating, this means that the secular events added using only Gregorian dates may also not act <i>completely</i> as you might expect. Nonetheless, I find that having other historical events on the timeline very helpful."
      ]
    },
    "ages": {
      "title": "Patriarch Ages: The Masoretic Text vs The Septuagint",
      "description_wTags": [
        "The ages of Adam through Terah found in Gen5 & Gen11 differ between the Masoretic Text (MT), Hebrew scriptures dating to the 2nd century AD, and the Septuagint (LXX), the Greek translation of the scriptures dating back possibly to the 3rd century BC. And for those curious about it, I'm not event going to bother with the Samaritan Pentateuch which appears to have a lot of problems in this area.",

        "It's important to note that, despite the preponderance of evidence, and by what I would consider a quirk of history, <i>all</i> English bible translations — even the most recent — are still using the ages found in the MT. I assume changing the dates at this point would probably raise too much ire and controversy, which is unfortunate.",

        "<0><0></0> <strong>$t(options.calculations.ages.title):</strong></0>",

        "<0>$t(options.calculations.ages.best)</0> — There are a whole host of factors indicating that the LXX should be trusted over the MT with regards to the patriarchal dates with a couple of minor exceptions. I have heavily referenced <1>the work of Henry B. Smith Jr. of the Associates of Biblical Research</1> on the topic, and this settings is based on his assertions which mostly follow the LXX, but make corrections in a couple of key places.",

        "<0>$t(options.calculations.ages.septuagint)</0> — Strictly follow the partiarchal ages found in the Septuagint.",

        "<0>$t(options.calculations.ages.masoretic)</0> — Strictly follow the partiarchal ages found in the Masoretic Text. Note that the MT excludes Kainan (son of Arphaxad and father of Shelah)."
      ]
    },
    "margins": {
      "title": "Margin of Error",
      "description_wTags": [
        "When constructing a Biblical timeline as I am doing here, there <i>will</i> be a margin of error on <i>all</i> of your dates. This is inescapable just from the fact that the Bible lists only the year and not the month or day for most events.",

        "For example, Gen5 & Gen11 list the years each patriarch had their first child, but were those births at the beginning of each year, the end, or more likely, somewhere in the middle? Naturally, that places a ±6mo margin of error on all dates where only a year is given.",

        "For practicality, all such dates are averaged — put into the middle of the year — and a ±6 month margin of error is added to a compounding number. Starting with Adam, by the time you get to Christ, you are looking at a swing of more than two decades on your dates. While this margin of error is hidden by default, it's important to remember that they are there and any impression of fine precision you might have is actually a bit of an illusion. Having said that, plus or minus a decade can still be very useful at the scale of millenia.",

        "<0><0></0> <strong>$t(options.display.margins.title)</strong> — Show / Hide</0> — Note that even though the Gregorian dates are still, in a way, subject to the compounding margin of error, those margins are <i>not</i> applied to or shown on secular, Gregorian-only dates on the timeline."
      ]
    },
    "jubilee": {
      "title": "Jubilee Years",
      "description_wTags": [
        "Leviticus 25 mandates the observation of a sabbath year — the <i>\"shmita\"</i> — every 7th year and a jubilee year after every 7th shmita. Apparently, there is some wiggle room for interpretation on just when the jubilee year occurs in relation to the shmita cycle. Below are the three different methods for calculating the jubilee year that I have seen floating around out there. Although the \"exclusive\" method seems the most obvious to me, I have included the others for visualization.",

        "<0><0></0> <strong>$t(options.calculations.jubilee.title):</strong></0>",
        "<0>$t(options.calculations.jubilee.inclusive)</0> — Each jubilee year <i>overlaps</i> with each 49th shmita. [49-year jubilee cycles]",

        "<0>$t(options.calculations.jubilee.exclusive)</0> — Each jubilee year begins <i>after</i> each 49th shmita and overlaps with the 1st year of the next shmita cycle. <code>[49-year jubilee cycles]</code>",

        "<0>$t(options.calculations.jubilee.intercalated)</0> — Each jubilee year begins <i>after</i> each 49th shmita and interrupts the shmita cycle with an intercalated (inserted) year. The first year of the next shmita cycle begins <i>after</i> the jubilee year. [50-year jubilee cycles] — Proponents of this view also claim that Daniel's 70 Weeks (shmita cycles) implies these extra jubilee years should be intercalated (added in) which means that the first 69 weeks of Daniel (483 years) would have an <i>additional</i> 9 jubilee years added in for a total of 492 years."
      ]
    },
    "crucifixion": {
      "title": "Crucifixion Date",
      "description_wTags": [
        "In which year, <i>exactly</i>, was Jesus crucified? To come up with an answer we first have to start with an understanding of Passover and the Feast of Unleavened Bread found in Exo12. The Passover was to be eaten in the evening after sundown (the beginning of the Jewish day) on the 14th day of the month of Abib. Following that, for seven days (Abib 15-21, inclusive), was the Feast of Unleavened Bread with the first day (Abib 15) and the last day (Abib 21) being \"high\" sabbath days — days that are to be treated like a sabbath, but don't necessarily fall on a Saturday.",

        "We know from the gospels that Jesus died around 3pm in the daytime following the passover meal (still Abib 14). John19:31 even reminds us that the next day, Abib 15, which would begin at sundown, was a high sabbath. We also know from the Gospels that Jesus rose sometime before dawn (early in the day) on the first day of the week (Sunday). We must then reconcile all this info with Matt12:40 and similar verses which tell us that Jesus would be in the tomb for 3 days and 3 nights. With all of that there are really only three days of the week that could be considered to meet the criteria for the day of the Crucifixion: Wednesday, Thursday, or Friday.",

        "On a personal note, my opinion is that for a Friday date to make sense you have to stretch inclusive time and the meaning of \"three days and nights\" almost to their breaking point taking \"day and night\" to mean a single 24-hour period, the whole of which you can count as long as some portion is included; I suspect that church tradition places the crucifixion on Friday because of a misunderstanding of the difference between a sabbath and a high sabbath. I personally lean towards it being on a Wednesday. At any rate, here's what the three options look like:",

        "<strong>Option 1: Jesus Died on a Friday</strong><br />1 day+night: Friday before sundown<br />1 day+night: Friday sundown - Saturday sundown<br />1 day+night: Saturday sundown - early Sunday",

        "<strong>Option 2: Jesus Died on a Thursday</strong><br />1 day: Thursday before sundown (partial day)<br />1 night: Thursday night<br />1 day: Friday before sundown<br />1 night: Friday night<br />1 day: Saturday till sundown<br />1 night: Saturday night (partial night)",

        "<strong>Option 3: Jesus Died on a Wednesday</strong><br />1 full night & 1 full day: Wednesday sundown - Thursday sundown<br />1 full night & 1 full day: Thursday sundown - Friday sundown<br />1 full night & 1 full day: Friday sundown - Saturday sundown",

        "<0><0></0> <strong>$t(options.calculations.crucifixion.title):</strong></0>",

        "<0>$t(options.calculations.crucifixion.optionLabels.0) - $t(options.calculations.crucifixion.optionLabels.2)</0> — I have found it difficult to find agreement as to which day of the week Passover falls on each year in the early first century. Within a ten-year window, you can use your own sources and set the AD date to whatever you think is correct."
      ]
    }
  },
  "project": {
    "tab": "Project",
    "description": "This project began in 2020 as a quickly hobbled together collection of PHP and CSS I threw together over a weekend just to visualize and verify some things I was reading about. Fast forward to 2024, where I have revisited the idea, but this time set out to build it properly — from the ground up, with modern web dev tools — into something that will hopefully be more usable for, not just me, but anyone who might find it useful!",
    "description2_wTags": "While I have included many options to accommodate differing views, interpretations, and sources, I doubt I have covered all scenarios. In other words, <i>I am in no way claiming any sort of expertise on this topic</i> ... but I'm also not claiming to come to this completely without opinion either. Mostly, though, I just wanted to do something with my development skills that might help someone else. Feel free to send me a message if you think there's something that could be improved or added, or if you are so inclined and able, the code for this project is available on Github for you to fork and tinker around with yourself.",
    "cookies": "Cookies are used for saving preferences only.",
    "builtWith": "Built With",
    "copyright": "<0 /> 2024, Darren Doyle",
    "contact": "Contact"
  },
  "options": {
    "tab": "Timeline Options",
    "notificationTitle": "What are all these settings?",
    "notificationText": "For detailed information about these options, why they're here and what they do, please see the notes.",
    "calculations": {
      "title": "Date Calculation",
      "ages": {
        "title": "Manuscript Source",
        "septuagint": "Septuagint",
        "masoretic": "Masoretic",
        "best": "Best Attested"
      },
      "jubilee": {
        "title": "Jubilee Years",
        "inclusive": "Inclusive",
        "exclusive": "Exclusive",
        "intercalated": "Intercalated"
      },
      "crucifixion": {
        "title": "Crucifixion Date",
        "optionLabels": ["25 A.D.", "30 A.D.", "35 A.D."]
      }
    },
    "display": {
      "title": "Display Options",
      "scale": {
        "title": "Horizontal Scale",
        "bigger": "Bigger",
        "smaller": "Smaller"
      },
      "trackMin": {
        "title": "Minimum Number of Vertical Tracks",
        "auto": "Auto",
        "ten": "10",
        "twenty": "20",
        "thirty": "30",
        "all": "Unlimited"
      },
      "margins": {
        "title": "Margin of Error",
        "on": "Show",
        "off": "Hide"
      },
      "showSource": {
        "title": "Event Details",
        "label": "Show reference tooltips?"
      },
      "calendar": {
        "ce": "CE",
        "am": "AM"
      }
    }
  },
  "eventPicker": {
    "button": "Go to Event...",
    "title": "Events are Ordered by Start Date"
  },
  "timeline": {
    "bibleReference": "{{book}} {{chapter}}:{{verse}}",
    "bibleReferenceRange": "{{book}} {{chapter}}:{{verseFrom}}-{{verseTo}}",
    "textSeparator": "  •  ",
    "dateAM": "{{year}} AM",
    "dateAD": "{{year}} AD",
    "dateBC": "{{year}} BC",
    "dateFuzzyAM": "ca.{{year}} AM",
    "dateFuzzyAD": "ca.{{year}} AD",
    "dateFuzzyBC": "ca.{{year}} BC",
    "date_wMargin_one": "{{date}} ±{{count}}yr",
    "date_wMargin_other": "{{date}} ±{{count}}yrs",
    "year_one": "{{count}} year",
    "year_other": "{{count}} years",
    "yearFuzzy_one": "≈{{count}} year",
    "yearFuzzy_other": "≈{{count}} years",
    "source": "Source:",
    "placement": "Placement:",
    "relativeStart_wTags_one": "{{count}} year from the beginning of: <0>$t(events.{{id}}.title)</0>",
    "relativeStart_wTags_zero": "At the beginning of: <0>$t(events.{{id}}.title)</0>",
    "relativeStart_wTags_other": "{{count}} years from the beginning of: <0>$t(events.{{id}}.title)</0>",
    "relativeEnd_wTags_one": "{{count}} year from the end of: <0>$t(events.{{id}}.title)</0>",
    "relativeEnd_wTags_zero": "At the end of: <0>$t(events.{{id}}.title)</0>",
    "relativeEnd_wTags_other": "{{count}} years from the end of: <0>$t(events.{{id}}.title)</0>"
  },
  "bible": {
    "Genesis": "Genesis",
    "Exodus": "Exodus",
    "Leviticus": "Leviticus",
    "Numbers": "Numbers",
    "Deuteronomy": "Deuteronomy",
    "Joshua": "Joshua",
    "Judges": "Judges",
    "Ruth": "Ruth",
    "1 Samuel": "1 Samuel",
    "2 Samuel": "2 Samuel",
    "1 Kings": "1 Kings",
    "2 Kings": "2 Kings",
    "1 Chronicles": "1 Chronicles",
    "2 Chronicles": "2 Chronicles",
    "Ezra": "Ezra",
    "Nehemiah": "Nehemiah",
    "Esther": "Esther",
    "Job": "Job",
    "Psalms": "Psalms",
    "Proverbs": "Proverbs",
    "Ecclesiastes": "Ecclesiastes",
    "Song of Solomon": "Song of Solomon",
    "Isaiah": "Isaiah",
    "Jeremiah": "Jeremiah",
    "Lamentations": "Lamentations",
    "Ezekiel": "Ezekiel",
    "Daniel": "Daniel",
    "Hosea": "Hosea",
    "Joel": "Joel",
    "Amos": "Amos",
    "Obadiah": "Obadiah",
    "Jonah": "Jonah",
    "Micah": "Micah",
    "Nahum": "Nahum",
    "Habakkuk": "Habakkuk",
    "Zephaniah": "Zephaniah",
    "Haggai": "Haggai",
    "Zechariah": "Zechariah",
    "Malachi": "Malachi",
    "Matthew": "Matthew",
    "Mark": "Mark",
    "Luke": "Luke",
    "John": "John",
    "Acts": "Acts",
    "Romans": "Romans",
    "1 Corinthians": "1 Corinthians",
    "2 Corinthians": "2 Corinthians",
    "Galatians": "Galatians",
    "Ephesians": "Ephesians",
    "Philippians": "Philippians",
    "Colossians": "Colossians",
    "1 Thessalonians": "1 Thessalonians",
    "2 Thessalonians": "2 Thessalonians",
    "1 Timothy": "1 Timothy",
    "2 Timothy": "2 Timothy",
    "Titus": "Titus",
    "Philemon": "Philemon",
    "Hebrews": "Hebrews",
    "James": "James",
    "1 Peter": "1 Peter",
    "2 Peter": "2 Peter",
    "1 John": "1 John",
    "2 John": "2 John",
    "3 John": "3 John",
    "Jude": "Jude",
    "Revelation": "Revelation"
  },
  "events": {
    "PATRIARCHS": "—————————————————————————————————————————————————————————————————",

    "adam": {
      "title": "Adam",
      "source": "Gen5:5",
      "placement": "At creation"
    },
    "seth": {
      "title": "Seth",
      "source": "Gen5:3,8",
      "placement": ""
    },
    "enosh": {
      "title": "Enosh",
      "source": "Gen5:6,11",
      "placement": ""
    },
    "kenan": {
      "title": "Kenan",
      "source": "Gen5:9,14",
      "placement": ""
    },
    "mahalalel": {
      "title": "Mahalalel",
      "source": "Gen5:12,17",
      "placement": ""
    },
    "jared": {
      "title": "Jared",
      "source": "Gen5:15,20",
      "placement": ""
    },
    "enoch": {
      "title": "Enoch",
      "source": "Gen5:18,23",
      "placement": ""
    },
    "methuselah": {
      "title": "Methuselah",
      "source": "Gen5:21,27",
      "placement": ""
    },
    "lamech": {
      "title": "Lamech",
      "source": "Gen5:25,31",
      "placement": ""
    },
    "noah": {
      "title": "Noah",
      "source": "Gen5:28",
      "placement": ""
    },

    "flood": {
      "title": "The Flood",
      "source": "Gen7:11, Gen8:13",
      "placement": ""
    },

    "shem": {
      "title": "Shem",
      "source": "Gen11:10-11",
      "placement": ""
    },
    "nimrod": {
      "title": "Nimrod [Speculation]",
      "source": "",
      "placement": ""
    },
    "arphaxad": {
      "title": "Arphaxad",
      "source": "Gen11:10-13",
      "placement": ""
    },
    "kainan": {
      "title": "Kainan",
      "source": "(Septuagint Only) Gen11:12-13",
      "placement": ""
    },
    "shelah": {
      "title": "Shelah",
      "source": "Gen11:12-15",
      "placement": ""
    },
    "eber": {
      "title": "Eber",
      "source": "Gen11:14-17",
      "placement": ""
    },
    "peleg": {
      "title": "Peleg",
      "source": "Gen11:15-19",
      "placement": ""
    },
    "reu": {
      "title": "Reu",
      "source": "Gen11:17-21",
      "placement": ""
    },
    "serug": {
      "title": "Serug",
      "source": "Gen11:19-23",
      "placement": ""
    },
    "nahor": {
      "title": "Nahor",
      "source": "Gen11:21-25",
      "placement": ""
    },
    "terah": {
      "title": "Terah",
      "source": "Gen11:24,32",
      "placement": ""
    },

    "ABRAHAM to the PROMISED LAND": "———————————————————————————————————————————————",

    "abraham": {
      "title": "Abraham",
      "source": "Gen12:4, Gen25:7, Acts7:4",
      "placement": ""
    },
    "covenant": {
      "title": "God's covenant with Abraham",
      "source": "Gen17:1-2",
      "placement": ""
    },
    "sojourn430": {
      "title": "Sojourning (430 Years)",
      "source": "",
      "placement": ""
    },
    "sojourn400": {
      "title": "Sojourning (400 Years)",
      "source": "",
      "placement": ""
    },
    "sojourn450": {
      "title": "Sojourning (450 Years)",
      "source": "",
      "placement": ""
    },
    "isaac": {
      "title": "Isaac",
      "source": "Gen21:5,Gen35:28",
      "placement": ""
    },
    "jacob": {
      "title": "Jacob (Israel)",
      "source": "Gen25:26, Gen47:28",
      "placement": ""
    },
    "jacobInEgypt": {
      "title": "Jacob's Time in Egypt",
      "source": "Gen47:28",
      "placement": ""
    },
    "joseph": {
      "title": "Joseph",
      "source": "Gen41:46, Gen50:26",
      "placement": ""
    },
    "josephEnslaved": {
      "title": "Joseph Enslaved in Egypt",
      "source": "Gen37:2",
      "placement": ""
    },
    "egyptFeastAndFamine": {
      "title": "7yrs of Plenty + 7yrs of Famine",
      "source": "Gen41:46-53, Gen45:4-6",
      "placement": ""
    },
    "exodus": {
      "title": "The Exodus",
      "source": "",
      "placement": ""
    },
    "moses": {
      "title": "Moses",
      "source": "Exo7:7, Deu34:7",
      "placement": ""
    },
    "mosesMidian": {
      "title": "Moses in Midian",
      "source": "Acts7:23-29",
      "placement": ""
    },
    "joshua": {
      "title": "Joshua",
      "source": "Josh14:7, Josh24:29",
      "placement": ""
    },
    "wandering": {
      "title": "Wandering in the Desert",
      "source": "",
      "placement": ""
    },
    "conquering": {
      "title": "Taking the Promised Land",
      "source": "",
      "placement": ""
    },
    "judges": {
      "title": "Time of the Judges",
      "source": "",
      "placement": ""
    },

    "KINGDOM AGE": "————————————————————————————————————————————————————————————————",

    "saul": {
      "title": "Saul's Reign",
      "source": "Acts13:21",
      "placement": ""
    },
    "saulReign": {
      "title": "Saul's Reign",
      "source": "NET|1Sam13:1, Acts13:21",
      "placement": ""
    },
    "temple1start": {
      "title": "The Building of the First Temple",
      "source": "",
      "placement": ""
    },
    "solomon": {
      "title": "Solomon's Reign",
      "source": "",
      "placement": ""
    },
    "rehoboam": {
      "title": "Rehoboam's Reign",
      "source": "",
      "placement": ""
    },
    "abijam": {
      "title": "Abijam's Reign",
      "source": "",
      "placement": ""
    },
    "asa": {
      "title": "Asa's Reign",
      "source": "",
      "placement": ""
    },
    "jehoshaphat": {
      "title": "Jehoshaphat's Reign",
      "source": "",
      "placement": ""
    },
    "jehoram": {
      "title": "Jehoram's Reign",
      "source": "",
      "placement": ""
    },
    "ahaziah": {
      "title": "Ahaziah's Reign",
      "source": "",
      "placement": ""
    },
    "athaliah": {
      "title": "Athaliah's Reign",
      "source": "",
      "placement": ""
    },
    "joash": {
      "title": "Joash's Reign",
      "source": "",
      "placement": ""
    },
    "amaziah": {
      "title": "Amaziah's Reign",
      "source": "",
      "placement": ""
    },
    "uzziah": {
      "title": "Uzziah's Reign",
      "source": "",
      "placement": ""
    },
    "jotham": {
      "title": "Jotham's Reign",
      "source": "",
      "placement": ""
    },
    "ahaz": {
      "title": "Ahaz's Reign",
      "source": "",
      "placement": ""
    },
    "hezekiah": {
      "title": "Hezekiah's Reign",
      "source": "",
      "placement": ""
    },
    "manasseh": {
      "title": "Manasseh's Reign",
      "source": "",
      "placement": ""
    },
    "amon": {
      "title": "Amon's Reign",
      "source": "",
      "placement": ""
    },
    "josiah": {
      "title": "Josiah's Reign",
      "source": "",
      "placement": ""
    },
    "jehoahaz": {
      "title": "Jehoahaz's Reign",
      "source": "",
      "placement": ""
    },
    "eliakim": {
      "title": "Eliakim's Reign",
      "source": "",
      "placement": ""
    },
    "jehoiachin": {
      "title": "Jehoiachin's Reign",
      "source": "",
      "placement": ""
    },
    "zedekiah": {
      "title": "Zedekiah's Reign",
      "source": "",
      "placement": ""
    },
    "daniel": {
      "title": "Daniel [Speculation]",
      "source": "",
      "placement": "Daniel was a young man when taken to captivity, which would most likely put him at 13-20 at the time of the exile. We also know that he served "
    },
    "exile": {
      "title": "The Exile",
      "source": "",
      "placement": ""
    },
    "dan69weeks": {
      "title": "First 69 Weeks of Daniel",
      "source": "",
      "placement": ""
    },
    "messiah": {
      "title": "Jesus Christ",
      "source": "",
      "placement": ""
    },

    "ROME": "———————————————————————————————————————————————————————————————————————",

    "rome_kingdom": {
      "title": "The Roman Kingdom",
      "source": "",
      "placement": "753-509 BC"
    },
    "rome_republic": {
      "title": "The Roman Republic",
      "source": "",
      "placement": "509-27 BC"
    },
    "rome_empire": {
      "title": "The Roman Empire",
      "source": "",
      "placement": "27 BC - 395 AD"
    },
    "rome_augustus": {
      "title": "Reign of Augustus",
      "source": "",
      "placement": "27 BC - 14 AD"
    },
    "rome_tiberius": {
      "title": "Reign of Tiberius",
      "source": "",
      "placement": "14-37 AD"
    },
    "rome_caligula": {
      "title": "Reign of Caligula",
      "source": "",
      "placement": "37-41 AD"
    },
    "rome_claudius": {
      "title": "Reign of Claudius",
      "source": "",
      "placement": "41-54 AD"
    },
    "rome_nero": {
      "title": "Reign of Nero",
      "source": "",
      "placement": "54-68 AD"
    },
    "rome_vespasian": {
      "title": "Reign of Vespasian",
      "source": "",
      "placement": "69-79 AD"
    },
    "rome_constantine1": {
      "title": "Reign of Constantine I",
      "source": "",
      "placement": "306-337 AD"
    },

    "ANCIENT(ish) HISTORY": "———————————————————————————————————————————————————————",

    "pyramidDjoser": {
      "title": "Pyramid of Djoser Built",
      "source": "",
      "placement": "2630-2610 BC"
    },
    "pyramidsGiza": {
      "title": "The Great Pyramids of Giza Built",
      "source": "",
      "placement": "2550-2410 BC"
    },
    "assyrianEmpire": {
      "title": "The Assyrian Empire",
      "source": "",
      "placement": "1363-609 BC"
    },
    "achaemenianEmpire": {
      "title": "The Achaemenian (Medo-Persian) Empire",
      "source": "",
      "placement": "538-330 BC"
    },
    "confucious": {
      "title": "Confucious",
      "source": "",
      "placement": "551-479 BC"
    },
    "buddha": {
      "title": "Siddhartha Gautama (Buddha)",
      "source": "",
      "placement": "563-483 BC"
    },
    "socrates": {
      "title": "Socrates",
      "source": "",
      "placement": "470-399 BC"
    },
    "plato": {
      "title": "Plato (Aristocles)",
      "source": "",
      "placement": "428-348 BC"
    },
    "aristotle": {
      "title": "Aristotle",
      "source": "",
      "placement": "384-322 BC"
    },
    "alexander": {
      "title": "Alexander the Great",
      "source": "",
      "placement": "384-322 BC"
    },

    "origen": {
      "title": "Origen",
      "source": "",
      "placement": "185-253 AD"
    },
    "augustine": {
      "title": "Augustine",
      "source": "",
      "placement": "354-430 AD"
    },
    "muhammad": {
      "title": "Muhammad",
      "source": "",
      "placement": "570-632 AD"
    },
    "temple2end": {
      "title": "Second Temple Destroyed",
      "source": "",
      "placement": "70 AD"
    },
    "nicaea1": {
      "title": "The First Council of Nicaea",
      "source": "",
      "placement": "325 AD"
    },

    "WARS": "———————————————————————————————————————————————————————————————————————",

    "war_7years": {
      "title": "The Seven Years War",
      "source": "",
      "placement": "1756-1763 AD"
    },
    "war_americanRevolution": {
      "title": "The American Revolution",
      "source": "",
      "placement": "1775-1783 AD"
    },
    "war_frenchRevolution": {
      "title": "The French Revolutionary Wars",
      "source": "",
      "placement": "1792-1802 AD"
    },
    "war_napoleonic": {
      "title": "The Napoleonic Wars",
      "source": "",
      "placement": "1803-1815 AD"
    },
    "war_americanCivil": {
      "title": "The American Civil War",
      "source": "",
      "placement": "1861-1865 AD"
    },
    "war_wwi": {
      "title": "World War I",
      "source": "",
      "placement": "1914-1918 AD"
    },
    "war_wwii": {
      "title": "World War II",
      "source": "",
      "placement": "1939-1945 AD"
    },
    "war_korean": {
      "title": "The Korean War",
      "source": "",
      "placement": "1950-1953 AD"
    },
    "war_vietnam": {
      "title": "The Vietnam War",
      "source": "",
      "placement": "1955-1975 AD"
    },
    "war_cold": {
      "title": "The Cold War",
      "source": "",
      "placement": "1947-1991 AD"
    },
    "war_gulf": {
      "title": "The Gulf War",
      "source": "",
      "placement": "1990-1991 AD"
    },
    "war_terror": {
      "title": "The War on Terror",
      "source": "",
      "placement": "2001-2021 AD"
    },

    "MODERN(ish) HISTORY": "————————————————————————————————————————————————————————",

    "schism": {
      "title": "The Great East-West Schism",
      "source": "",
      "placement": "1054 AD"
    },
    "ottoman": {
      "title": "The Ottoman Empire",
      "source": "",
      "placement": "1299-1453 AD"
    },
    "blackDeath": {
      "title": "The Black Plague",
      "source": "",
      "placement": "1346-1353 AD"
    },
    "gutenburg": {
      "title": "The Gutenburg Bible",
      "source": "",
      "placement": "1450s AD"
    },
    "calvin": {
      "title": "John Calvin",
      "source": "",
      "placement": "1509-1564 AD"
    },
    "reformation": {
      "title": "The Reformation",
      "source": "",
      "placement": "1517-1685 AD"
    },
    "greatDepression": {
      "title": "The Great Depression",
      "source": "",
      "placement": "1929-1939 AD"
    },
    "deadSeaScrolls": {
      "title": "Dead Sea Scrolls Found",
      "source": "",
      "placement": "1947 AD"
    },
    "israelReformed": {
      "title": "Restoration of Israel",
      "source": "",
      "placement": "1948 AD"
    },
    "moonLanding": {
      "title": "First Moon Landing",
      "source": "",
      "placement": "1969 AD"
    },

    "today": {
      "title": "✱ YOU ARE HERE",
      "source": "",
      "placement": ""
    }
  }
}
